c#/c#笔记.html
<?xml version="1.0" encoding="gb2312"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>c#笔记</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb2312"/>
<meta name="title" content="c#笔记"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-25 17:38:22 中国标准时间"/>
<meta name="author" content="emacsers"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">c#笔记</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 简介</a>
<ul>
<li><a href="#sec-1-1">1.1 .Net Framework的功能和包含的内容</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 特点</a></li>
<li><a href="#sec-1-1-2">1.1.2 内容</a></li>
<li><a href="#sec-1-1-3">1.1.3 编写过程</a></li>
<li><a href="#sec-1-1-4">1.1.4 含义</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 .Net 应用程序的工作原理</a></li>
<li><a href="#sec-1-3">1.3 c#的概率和.net的关系</a></li>
<li><a href="#sec-1-4">1.4 开发工具</a></li>
</ul>
</li>
<li><a href="#sec-2">2 编写简单的c#程序</a>
<ul>
<li><a href="#sec-2-1">2.1 命令行程序</a></li>
<li><a href="#sec-2-2">2.2 windows form程序</a></li>
</ul>
</li>
<li><a href="#sec-3">3 变量和表达式</a>
<ul>
<li><a href="#sec-3-1">3.1 基本语法</a></li>
<li><a href="#sec-3-2">3.2 变量及其用法</a></li>
<li><a href="#sec-3-3">3.3 表达式及其用法</a></li>
<li><a href="#sec-3-4">3.4 流程控制</a></li>
<li><a href="#sec-3-5">3.5 类型之间的转换</a></li>
<li><a href="#sec-3-6">3.6 枚举类型</a></li>
<li><a href="#sec-3-7">3.7 结构类型</a></li>
<li><a href="#sec-3-8">3.8 数组</a></li>
<li><a href="#sec-3-9">3.9 字符串</a></li>
</ul>
</li>
<li><a href="#sec-4">4 函数</a>
<ul>
<li><a href="#sec-4-1">4.1 引用参数和值参数</a></li>
<li><a href="#sec-4-2">4.2 输出参数</a></li>
<li><a href="#sec-4-3">4.3 结构函数</a></li>
<li><a href="#sec-4-4">4.4 重载</a></li>
<li><a href="#sec-4-5">4.5 委托</a></li>
</ul>
</li>
<li><a href="#sec-5">5 调试和错误处理</a></li>
<li><a href="#sec-6">6 对象</a>
<ul>
<li><a href="#sec-6-1">6.1 简介</a></li>
<li><a href="#sec-6-2">6.2 构造阶段</a></li>
<li><a href="#sec-6-3">6.3 析构阶段</a></li>
<li><a href="#sec-6-4">6.4 静态和实例类成员</a></li>
<li><a href="#sec-6-5">6.5 oop技术</a></li>
</ul>
</li>
<li><a href="#sec-7">7 定义类</a>
<ul>
<li><a href="#sec-7-1">7.1 控制可访问性和继承的关键字</a></li>
<li><a href="#sec-7-2">7.2 构造函数</a></li>
<li><a href="#sec-7-3">7.3 析构函数</a></li>
</ul>
</li>
<li><a href="#sec-8">8 定义类成员</a>
<ul>
<li><a href="#sec-8-1">8.1 成员定义</a></li>
<li><a href="#sec-8-2">8.2 方法修饰</a></li>
<li><a href="#sec-8-3">8.3 自动属性</a></li>
<li><a href="#sec-8-4">8.4 隐藏基类成员</a></li>
<li><a href="#sec-8-5">8.5 调用重写或隐藏的基类方法</a></li>
<li><a href="#sec-8-6">8.6 接口</a></li>
<li><a href="#sec-8-7">8.7 代码折叠</a></li>
</ul>
</li>
<li><a href="#sec-9">9 集合 比较 和转换</a>
<ul>
<li><a href="#sec-9-1">9.1 定义和使用集合</a></li>
<li><a href="#sec-9-2">9.2 使用不同类型的集合</a></li>
<li><a href="#sec-9-3">9.3 比较类型</a></li>
<li><a href="#sec-9-4">9.4 比较值</a></li>
<li><a href="#sec-9-5">9.5 转换</a></li>
<li><a href="#sec-9-6">9.6 as运算符</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> .Net Framework的功能和包含的内容</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 特点</h4>
<div class="outline-text-4" id="text-1-1-1">

<ul>
<li>mono 多种操作系统
</li>
<li>支持多种语言
</li>
<li>可以作为集成各种操作系统的方式
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 内容</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li>CTS
</li>
<li>CLR
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 编写过程</h4>
<div class="outline-text-4" id="text-1-1-3">

<ul>
<li id="sec-1-1-3-1">CIL和JIT<br/>
<ul>
<li>编译时将代码编译为CIL
</li>
<li>JIT,在需要编译时才编译为目标机器代码
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-1-3-2">程序集<br/>
<ul>
<li>CIL代码
<ul>
<li>包括可以执行的应用程序文件和其他应用程序需要的库
</li>
</ul>

</li>
<li>元信息
<ul>
<li>程序集中保函的数据的信息
</li>
</ul>

</li>
<li>可选资源
<ul>
<li>声音文件和图片 
</li>
</ul>

</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-1-3-3">托管代码<br/>
<ul>
<li>CLR管理的应用程序
<ul>
<li>方式是内存管理,处理安全性已经允许跨语言调试
</li>
</ul>

</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-1-3-4">垃圾回收<br/>
<ul>
<li>有时需要自己执行垃圾回收检测
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-1-3-5">组合<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-3-6">链接<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> 含义</h4>
<div class="outline-text-4" id="text-1-1-4">

<ul>
<li>为.net开发的一种语言
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> .Net 应用程序的工作原理</h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> c#的概率和.net的关系</h3>
<div class="outline-text-3" id="text-1-3">

</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 开发工具</h3>
<div class="outline-text-3" id="text-1-4">

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 编写简单的c#程序</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 命令行程序</h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> windows form程序</h3>
<div class="outline-text-3" id="text-2-2">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 变量和表达式</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 基本语法</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>不考虑空格回车或tab
</li>
<li>每个语句都用一个分号来结束
</li>
<li>所有的语句都是代码库的一部分({})
</li>
<li>注释的方式
<ul>
<li>开头或结尾
</li>
<li><i>* 注释内容  *</i> 
</li>
<li>/// 可以导出为说明书
</li>
</ul>

</li>
<li>区分大小写
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 变量及其用法</h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 表达式及其用法</h3>
<div class="outline-text-3" id="text-3-3">

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 流程控制</h3>
<div class="outline-text-3" id="text-3-4">

<ul>
<li>&amp; | 与 &amp;&amp; || 的区别
<ul>
<li>&amp;&amp; 性能更好,且如果前面的已经计算出结果false,就不考虑后面的计算了*  对象的生命周期
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 类型之间的转换</h3>
<div class="outline-text-3" id="text-3-5">

<ul>
<li>显式
<ul>
<li>(目标类型)源类型
</li>
<li>溢出检查 checked / unchecked
</li>
</ul>

</li>
<li>Convert.to***
</li>
</ul>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 枚举类型</h3>
<div class="outline-text-3" id="text-3-6">




<pre class="src src-java">   <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">orientation</span>{
        <span style="color: #b8860b;">north</span> = 1,
        <span style="color: #b8860b;">south</span> = 2,
        <span style="color: #b8860b;">east</span> = 3,
        <span style="color: #b8860b;">west</span> = 4
}
</pre>

</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 结构类型</h3>
<div class="outline-text-3" id="text-3-7">




<pre class="src src-java"><span style="color: #228b22;">struct</span> <span style="color: #b8860b;">route</span>{
              <span style="color: #a020f0;">public</span> <span style="color: #228b22;">orientation</span> <span style="color: #b8860b;">direction</span>;
              <span style="color: #a020f0;">public</span> <span style="color: #228b22;">double</span> <span style="color: #b8860b;">distance</span>;
      }
</pre>

</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 数组</h3>
<div class="outline-text-3" id="text-3-8">

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 字符串</h3>
<div class="outline-text-3" id="text-3-9">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 函数</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 引用参数和值参数</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>ref
<ul>
<li>修饰需要修改的传入参数值
</li>
<li>调用该函数时,也要用ref来修饰参数
</li>
</ul>

</li>
</ul>




<pre class="src src-java"><span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">ShowDouble</span>(ref <span style="color: #228b22;">int</span> <span style="color: #b8860b;">val</span>){
  val *=2;
   <span style="color: #5f9ea0;">Console</span>.WriteLine(<span style="color: #bc8f8f;">"val doubled = {0}"</span>,val)
}
</pre>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 输出参数</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>在函数执行完毕之后,该参数的值返回给函数调用中的使用变量
<ul>
<li>functionName(out  type param)
</li>
</ul>

</li>
<li>与 ref的区别
<ul>
<li>把未赋值的变量用作ref参数是非法的,但是可以用作out参数
</li>
<li>函数在使用out参数时,必须看作为赋值
</li>
<li>out参数在方法外部声明
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 结构函数</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>结构中的函数
</li>
</ul>

</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 重载</h3>
<div class="outline-text-3" id="text-4-4">

</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 委托</h3>
<div class="outline-text-3" id="text-4-5">

<ul>
<li>定义
<ul>
<li>把引用存储为函数的类型
</li>
</ul>

</li>
<li>除了直接调用函数之外,还可以通过委托调用
</li>
<li>委托是用返回类型和参数列表定义的变量
</li>
<li>给定的委托类型可以匹配类型和参数与委托定义相同的方法
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 调试和错误处理</h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 对象</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 简介</h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li>基本同java
</li>
<li>命名
<ul>
<li>第一个字符必须是字母,下划线或@,其他的字符可以是数字
</li>
</ul>

</li>
<li>命名规则
<ul>
<li>简单使用camelCase
</li>
<li>复杂使用PascalCase
</li>
</ul>

</li>
<li>类型的转换
<ul>
<li>Convert.toDouble('''');
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 构造阶段</h3>
<div class="outline-text-3" id="text-6-2">

<ul>
<li>对象的实例化,由构造函数完成
</li>
<li>构造函数可以是私有或公有的
<ol>
<li>在类的外部不能使用私有的构造函数来实例化对象
</li>
<li>没有公共构造函数的类不能在外部进行实例化
</li>
</ol>

</li>
</ul>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 析构阶段</h3>
<div class="outline-text-3" id="text-6-3">

<ul>
<li>删除对象时的清理,由析构函数完成
</li>
<li>不应依赖析构函数来释放对象实例使用的资源
</li>
</ul>

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 静态和实例类成员</h3>
<div class="outline-text-3" id="text-6-4">

<ul>
<li>静态构造函数
<ul>
<li>一个类只能有一个静态的构造函数
</li>
<li>不能有访问修饰符
</li>
<li>不能有参数
</li>
<li>不能直接调用
</li>
</ul>

</li>
<li>静态类
</li>
</ul>

</div>

</div>
