c#/c#笔记.html

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> oop技术</h3>
<div class="outline-text-3" id="text-6-5">

<ul>
<li>接口
  +一般用Ｉ开头
<ul>
<li>IDisposable接口
<ul>
<li>支持IDisposable接口的对象必须实现Dispose()方法
</li>
<li>立即释放资源
</li>
<li>using关键字可以在代码库中初始化使用重要资源的对象,会在代码块末尾自动调用Dispose()方法
</li>
</ul>

</li>
</ul>

</li>
</ul>




<pre class="src src-c#">// &#31532;&#19968;&#31181;&#26041;&#27861;
&lt;ClassName&gt; &lt;variableName&gt; = new &lt;ClassName&gt;();
using(&lt;variableName&gt;){
 .....
}
// &#31532;&#20108;&#31181;&#26041;&#27861;
using(&lt;ClassName&gt; &lt;variableName&gt; = new &lt;ClassName&gt;()){
 ......
}
</pre>

<ul>
<li>继承
<ul>
<li>派生类不能访问基类的私有成员
</li>
<li>第 三种可访问性 protected &ndash; 只有派生类可访问
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 定义类</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 控制可访问性和继承的关键字</h3>
<div class="outline-text-3" id="text-7-1">

<ul>
<li>internal
<ul>
<li>默认情况下类声明是内部的,只有当前项目中的代码才能访问它.
</li>
</ul>

</li>
<li>public 
<ul>
<li>公共类,其他项目中代码可访问
</li>
</ul>

</li>
<li>abstract
<ul>
<li>不能实例化,只能继承,可以有抽象成员
</li>
</ul>

</li>
<li>sealed
<ul>
<li>密封的,不能再派生
</li>
</ul>

</li>
<li>继承
</li>
<li>接口
</li>
</ul>




<pre class="src src-c#">// &#32487;&#25215;
 public class myClass : MyBase {... }
// &#25509;&#21475;&#21644;&#22522;&#31867;
 public class myClass : IMyInterface, MyBase{... }
</pre>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 构造函数</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li>私有构造函数
<ul>
<li>类是不可创建的
</li>
</ul>

</li>
<li>执行序列
<ul>
<li>构造函数后 + :base(索引)
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 析构函数</h3>
<div class="outline-text-3" id="text-7-3">

<ul>
<li>~前缀 + 类名称
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 定义类成员</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 成员定义</h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>public 
<ul>
<li>由任意代码访问
</li>
</ul>

</li>
<li>private 
<ul>
<li>由类中的代码访问(默认关键字)
</li>
</ul>

</li>
<li>internal
<ul>
<li>由定义它的程序集(项目)内部的代码访问
</li>
</ul>

</li>
<li>protected
<ul>
<li>有类或派生类的代码访问
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 方法修饰</h3>
<div class="outline-text-3" id="text-8-2">

<ul>
<li>virtual 
<ul>
<li>方法可以重写
</li>
</ul>

</li>
<li>abstract
<ul>
<li>方法必须在非抽象的派生类中重写
</li>
</ul>

</li>
<li>override
<ul>
<li>重写了基类方法
</li>
</ul>

</li>
<li>extern 
<ul>
<li>方法定义放在其他地方
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 自动属性</h3>
<div class="outline-text-3" id="text-8-3">




<pre class="src src-c#">public int MyIntPot{get; set;}
</pre>

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 隐藏基类成员</h3>
<div class="outline-text-3" id="text-8-4">




<pre class="src src-c#"> public class myDrivedClass : MyBaseClass
{
 // &#27492;&#22788;&#30340;&#26041;&#27861;&#26159;&#37325;&#20889;&#22522;&#31867;&#30340;&#26041;&#27861;,new &#20851;&#38190;&#23383;&#21487;&#36991;&#20813;&#35686;&#21578;
  new public void doSomeThing()
  {}
}
</pre>


</div>

</div>

<div id="outline-container-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 调用重写或隐藏的基类方法</h3>
<div class="outline-text-3" id="text-8-5">

<ul>
<li>base调用基类方法
</li>
<li>this 调用本地的方法
</li>
</ul>


</div>

</div>

<div id="outline-container-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> 接口</h3>
<div class="outline-text-3" id="text-8-6">

<ul>
<li>不允许使用访问修饰符
</li>
<li>不能包含代码体
</li>
<li>不能定义字段成员
</li>
<li>不能使用关键字定义
</li>
<li>定义成员是禁止的
</li>
<li>显示实现接口中的方法
<ul>
<li>I接口名称.接口方法()
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> 代码折叠</h3>
<div class="outline-text-3" id="text-8-7">




<pre class="src src-c#">#region &#20195;&#30721;&#27573;&#21517;&#31216;
 // &#20195;&#30721;...
#endregion
</pre>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 集合 比较 和转换</h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 定义和使用集合</h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>数组
<ul>
<li>System.Array类的实例
</li>
</ul>

</li>
<li>集合
<ul>
<li>方法通过System.Collections中的接口获得
</li>
</ul>

</li>
<li>几个接口
<ul>
<li>IEnumerable
<ul>
<li>迭代集合中的项
</li>
</ul>

</li>
<li>ICollection
<ul>
<li>获得集合中项的个数
</li>
</ul>

</li>
<li>IList
<ul>
<li>集合的项列表
</li>
</ul>

</li>
<li>IDictionary
<ul>
<li>键值对存取
</li>
</ul>

</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 使用不同类型的集合</h3>
<div class="outline-text-3" id="text-9-2">

<ul>
<li>数组和集合的差别
<ul>
<li>数组只能固定大小来初始化
</li>
<li>ArrayList不需要初始化大小
</li>
</ul>

</li>
<li>索引符
<ul>
<li>特殊类型的属性,可提供类似数组的访问
</li>
</ul>

</li>
</ul>

</div>

</div>
