c#/c#笔记.html

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 比较类型</h3>
<div class="outline-text-3" id="text-9-3">

</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 比较值</h3>
<div class="outline-text-3" id="text-9-4">

</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> 转换</h3>
<div class="outline-text-3" id="text-9-5">

</div>

</div>

<div id="outline-container-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> as运算符</h3>
<div class="outline-text-3" id="text-9-6">




<pre class="src src-java"><span style="color: #b22222;">/*</span>
<span style="color: #b22222;"> * Created by SharpDevelop.</span>
<span style="color: #b22222;"> * User: Administrator</span>
<span style="color: #b22222;"> * Date: 2012-7-18</span>
<span style="color: #b22222;"> * Time: 16:33</span>
<span style="color: #b22222;"> * </span>
<span style="color: #b22222;"> * To change this template use Tools | Options | Coding | Edit Standard Headers.</span>
<span style="color: #b22222;"> */</span>
<span style="color: #228b22;">using</span> <span style="color: #b8860b;">System</span>;
<span style="color: #228b22;">using</span> <span style="color: #5f9ea0;">System</span>.<span style="color: #b8860b;">Collections</span>;
<span style="color: #228b22;">using</span> <span style="color: #5f9ea0;">System</span>.<span style="color: #5f9ea0;">Collections</span>.<span style="color: #b8860b;">Generic</span>;
<span style="color: #228b22;">namespace</span> <span style="color: #b8860b;">HelloWorld</span>
{
        <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">orientation</span>{
                <span style="color: #b8860b;">north</span> = 1,
                <span style="color: #b8860b;">south</span> = 2,
                <span style="color: #b8860b;">east</span> = 3,
                <span style="color: #b8860b;">west</span> = 4
        }

        <span style="color: #228b22;">struct</span> <span style="color: #b8860b;">route</span>{
                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">orientation</span> <span style="color: #b8860b;">direction</span>;
                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">double</span> <span style="color: #b8860b;">distance</span>;

                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">string</span> <span style="color: #b8860b;">getDesc</span>(){
                        <span style="color: #a020f0;">return</span> <span style="color: #bc8f8f;">" &#26041;&#21521;&#26159; "</span> + direction + <span style="color: #bc8f8f;">",&#36317;&#31163;&#26159;"</span> + distance;
                }
        }

        <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">abstract</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Animal</span>
        {
                <span style="color: #a020f0;">protected</span> <span style="color: #228b22;">string</span> <span style="color: #b8860b;">name</span>;

                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">string</span> <span style="color: #b8860b;">Name</span>
                {
                        get{<span style="color: #a020f0;">return</span> name;}
                        set{name = value;}
                }

                <span style="color: #a020f0;">public</span> Animal()
                {
                        name = <span style="color: #bc8f8f;">"the animal has no name!"</span>;
                }

                <span style="color: #a020f0;">public</span> Animal(<span style="color: #228b22;">string</span> <span style="color: #b8860b;">newName</span>)
                {
                        name = newName;
                }

                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">Feed</span>()
                {
                        <span style="color: #5f9ea0;">Console</span>.WriteLine(<span style="color: #bc8f8f;">"the animal {0} has been feed!"</span>,name);
                }
        }

        <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Cow</span> : Animal
        {
                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #b8860b;">Milk</span>()
                {
                        <span style="color: #5f9ea0;">Console</span>.WriteLine(<span style="color: #bc8f8f;">"the animal {0} has been milked."</span>, name);
                }

                <span style="color: #a020f0;">public</span> Cow(<span style="color: #228b22;">string</span> <span style="color: #b8860b;">newName</span>) :base(newName){}
        }

        <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Animals</span> : CollectionBase
        {
                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #b8860b;">add</span>(<span style="color: #228b22;">Animal</span> <span style="color: #b8860b;">newAnimal</span>)
                {
                        <span style="color: #5f9ea0;">List</span>.Add(newAnimal);
                }

                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">void</span> <span style="color: #b8860b;">remove</span>(<span style="color: #228b22;">Animal</span> <span style="color: #b8860b;">newAnimal</span>)
                {
                        <span style="color: #5f9ea0;">List</span>.Remove(newAnimal);
                }

                <span style="color: #a020f0;">public</span> Animals(){}

                <span style="color: #a020f0;">public</span> <span style="color: #228b22;">Animal</span> <span style="color: #a020f0;">this</span>[<span style="color: #228b22;">int</span> animalIndex]
                {
                        get
                        {
                                <span style="color: #a020f0;">return</span> (<span style="color: #228b22;">Animal</span>)List[animalIndex];
                        }

                        set
                        {
                                <span style="color: #228b22;">List</span>[animalIndex] = value;
                        }
                }

        }
        <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Program</span>
        {
                <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">Main</span>(<span style="color: #228b22;">string</span>[] <span style="color: #b8860b;">args</span>)
                {
<span style="color: #b22222;">//                      </span><span style="color: #b22222;">orientation myOrientation = orientation.north;</span>
<span style="color: #b22222;">//                      </span>
<span style="color: #b22222;">//                      </span><span style="color: #b22222;">route myroute;</span>
<span style="color: #b22222;">//                      </span><span style="color: #b22222;">myroute.direction = myOrientation;</span>
<span style="color: #b22222;">//                      </span><span style="color: #b22222;">myroute.distance = 12.534;</span>
<span style="color: #b22222;">//                      </span>
<span style="color: #b22222;">//                      </span><span style="color: #b22222;">Console.WriteLine("{0}",myroute.getDesc());</span>

                        <span style="color: #228b22;">Animals</span> <span style="color: #b8860b;">animalsCollection</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Animals</span>();
                        animalsCollection.add(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Cow</span>(<span style="color: #bc8f8f;">"lord"</span>));
                        animalsCollection.add(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Cow</span>(<span style="color: #bc8f8f;">"king"</span>));

                        foreach(Animal myAnimal <span style="color: #228b22;">in</span> <span style="color: #b8860b;">animalsCollection</span>)
                        {
                                <span style="color: #5f9ea0;">myAnimal</span>.Feed();
                        }
                        <span style="color: #5f9ea0;">Console</span>.ReadKey(<span style="color: #5f9ea0;">true</span>);
                }
        }
}
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-25 17:38:22 中国标准时间</p>
<p class="author">Author: emacsers</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
